---
kind: type
id: T:Autodesk.Revit.DB.FabricationConnectorInfo
source: html/5da97d87-a3f6-f239-3c5c-102d2d82f942.htm
---
# Autodesk.Revit.DB.FabricationConnectorInfo

Fabrication connector information.

## Syntax (C#)
```csharp
public class FabricationConnectorInfo : IDisposable
```